StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730a/core/rtw_rf.c
/*
 * Get available op channels by @param cch, @param bw
 * @cch: the given center channel
 * @bw: the given bandwidth
 * @op_chs: the pointer to return pointer of op channel array
 * @op_ch_num: the pointer to return pointer of op channel number
 *
 * return valid (1) or not (0)
 */
u8 rtw_get_op_chs_by_cch_bw(u8 cch, u8 bw, u8 **op_chs, u8 *op_ch_num)
{
	int i;
	struct center_chs_ent_t *c_chs_ent = NULL;
	struct op_chs_ent_t *op_chs_ent = NULL;
	u8 valid = 1;

	if (cch <= 14
	    && bw <= CHANNEL_WIDTH_40
	   ) {
		c_chs_ent = &center_chs_2g_by_bw[bw];
		op_chs_ent = &op_chs_of_cch_2g_by_bw[bw];
	} else if (cch >= 36 && cch <= 177
		   && bw <= CHANNEL_WIDTH_160
		  ) {
		c_chs_ent = &center_chs_5g_by_bw[bw];
		op_chs_ent = &op_chs_of_cch_5g_by_bw[bw];
	} else {
		valid = 0;
		goto exit;
	}

	for (i = 0; i < c_chs_ent->ch_num; i++)
		if (cch == *(c_chs_ent->chs + i)) {
			break;
		}

	if (i == c_chs_ent->ch_num) {
		valid = 0;
		goto exit;
	}

	*op_chs = op_chs_ent->chs + op_chs_ent->ch_num * i;
	*op_ch_num = op_chs_ent->ch_num;

exit:
	return valid;
}

u8 rtw_get_offset_by_chbw(u8 ch, u8 bw, u8 *r_offset)
{
	u8 valid = 1;
	u8 offset = HAL_PRIME_CHNL_OFFSET_DONT_CARE;

	if (bw == CHANNEL_WIDTH_20) {
		goto exit;
	}

	if (bw >= CHANNEL_WIDTH_80 && ch <= 14) {
		valid = 0;
		goto exit;
	}

	if (ch >= 1 && ch <= 4) {
		offset = HAL_PRIME_CHNL_OFFSET_LOWER;
	} else if (ch >= 5 && ch <= 9) {
		if (*r_offset == HAL_PRIME_CHNL_OFFSET_LOWER || *r_offset == HAL_PRIME_CHNL_OFFSET_UPPER) {
			offset = *r_offset;        /* both lower and upper is valid, obey input value */
		} else {
			offset = HAL_PRIME_CHNL_OFFSET_UPPER;        /* default use upper */
		}
	} else if (ch >= 10 && ch <= 13) {
		offset = HAL_PRIME_CHNL_OFFSET_UPPER;
	} else if (ch == 14) {
		valid = 0; /* ch14 doesn't support 40MHz bandwidth */
		goto exit;
	} else if (ch >= 36 && ch <= 177) {
		switch (ch) {
		case 36:
		case 44:
		case 52:
		case 60:
		case 100:
		case 108:
		case 116:
		case 124:
		case 132:
		case 140:
		case 149:
		case 157:
		case 165:
		case 173:
			offset = HAL_PRIME_CHNL_OFFSET_LOWER;
			break;
		case 40:
		case 48:
		case 56:
		case 64:
		case 104:
		case 112:
		case 120:
		case 128:
		case 136:
		case 144:
		case 153:
		case 161:
		case 169:
		case 177:
			offset = HAL_PRIME_CHNL_OFFSET_UPPER;
			break;
		default:
			valid = 0;
			break;
		}
	} else {
		valid = 0;
	}

exit:
	if (valid && r_offset) {
		*r_offset = offset;
	}
	return valid;
}

u8 rtw_get_center_ch(u8 ch, u8 bw, u8 offset)
{
	u8 cch = ch;

	if (bw == CHANNEL_WIDTH_160) {
		if (ch % 4 == 0) {
			if (ch >= 36 && ch <= 64) {
				cch = 50;
			} else if (ch >= 100 && ch <= 128) {
				cch = 114;
			}
		} else if (ch % 4 == 1) {
			if (ch >= 149 && ch <= 177) {
				cch = 163;
			}
		}

	} else if (bw == CHANNEL_WIDTH_80) {
		if (ch <= 14) {
			cch = 7;        /* special case for 2.4G */
		} else if (ch % 4 == 0) {
			if (ch >= 36 && ch <= 48) {
				cch = 42;
			} else if (ch >= 52 && ch <= 64) {
				cch = 58;
			} else if (ch >= 100 && ch <= 112) {
				cch = 106;
			} else if (ch >= 116 && ch <= 128) {
				cch = 122;
			} else if (ch >= 132 && ch <= 144) {
				cch = 138;
			}
		} else if (ch % 4 == 1) {
			if (ch >= 149 && ch <= 161) {
				cch = 155;
			} else if (ch >= 165 && ch <= 177) {
				cch = 171;
			}
		}

	} else if (bw == CHANNEL_WIDTH_40) {
		if (offset == HAL_PRIME_CHNL_OFFSET_LOWER) {
			cch = ch + 2;
		} else if (offset == HAL_PRIME_CHNL_OFFSET_UPPER) {
			cch = ch - 2;
		}

	} else if (bw == CHANNEL_WIDTH_20
		   || bw == CHANNEL_WIDTH_10
		   || bw == CHANNEL_WIDTH_5
		  )
		; /* same as ch */
	else {
		rtw_warn_on(1);
	}

	return cch;
}

u8 rtw_get_ch_group(u8 ch, u8 *group, u8 *cck_group)
{
	BAND_TYPE band = BAND_MAX;
	s8 gp = -1, cck_gp = -1;

	if (ch <= 14) {
		band = BAND_ON_2_4G;

		if (1 <= ch && ch <= 2) {
			gp = 0;
		} else if (3  <= ch && ch <= 5) {
			gp = 1;
		} else if (6  <= ch && ch <= 8) {
			gp = 2;
		} else if (9  <= ch && ch <= 11) {
			gp = 3;
		} else if (12 <= ch && ch <= 14) {
			gp = 4;
		} else {
			band = BAND_MAX;
		}

		if (ch == 14) {
			cck_gp = 5;
		} else {
			cck_gp = gp;
		}
	} else {
		band = BAND_ON_5G;

		if (36 <= ch && ch <= 42) {
			gp = 0;
		} else if (44   <= ch && ch <=  48) {
			gp = 1;
		} else if (50   <= ch && ch <=  58) {
			gp = 2;
		} else if (60   <= ch && ch <=  64) {
			gp = 3;
		} else if (100  <= ch && ch <= 106) {
			gp = 4;
		} else if (108  <= ch && ch <= 114) {
			gp = 5;
		} else if (116  <= ch && ch <= 122) {
			gp = 6;
		} else if (124  <= ch && ch <= 130) {
			gp = 7;
		} else if (132  <= ch && ch <= 138) {
			gp = 8;
		} else if (140  <= ch && ch <= 144) {
			gp = 9;
		} else if (149  <= ch && ch <= 155) {
			gp = 10;
		} else if (157  <= ch && ch <= 161) {
			gp = 11;
		} else if (165  <= ch && ch <= 171) {
			gp = 12;
		} else if (173  <= ch && ch <= 177) {
			gp = 13;
		} else {
			band = BAND_MAX;
		}
	}

	if (band == BAND_MAX
	    || (band == BAND_ON_2_4G && cck_gp == -1)
	    || gp == -1
	   ) {
		RTW_WARN("%s invalid channel:%u", __func__, ch);
		rtw_warn_on(1);
		goto exit;
	}

	if (group) {
		*group = gp;
	}
	if (cck_group && band == BAND_ON_2_4G) {
		*cck_group = cck_gp;
	}

exit:
	return band;
}

#if CONFIG_IEEE80211_BAND_6GHZ
int rtw_6gch2freq(int chan)
{
	if (chan >= 1 && chan <= 253) {
		return 5950 + chan * 5;
	}

	return 0; /* not supported */
}
#endif

int rtw_ch2freq(int chan)
{
	/* see 802.11 17.3.8.3.2 and Annex J
	* there are overlapping channel numbers in 5GHz and 2GHz bands */

	/*
	* RTK: don't consider the overlapping channel numbers: 5G channel <= 14,
	* because we don't support it. simply judge from channel number
	*/

	if (chan >= 1 && chan <= 14) {
		if (chan == 14) {
			return 2484;
		} else if (chan < 14) {
			return 2407 + chan * 5;
		}
	} else if (chan >= 36 && chan <= 177) {
		return 5000 + chan * 5;
	}

	return 0; /* not supported */
}

int rtw_ch2freq_by_band(BAND_TYPE band, int ch)
{
#if CONFIG_IEEE80211_BAND_6GHZ
	if (band == BAND_ON_6G) {
		return rtw_6gch2freq(ch);
	} else
#endif
		return rtw_ch2freq(ch);
}

int rtw_freq2ch(int freq)
{
	/* see 802.11 17.3.8.3.2 and Annex J */
	if (freq == 2484) {
		return 14;
	} else if (freq < 2484) {
		return (freq - 2407) / 5;
	} else if (freq >= 4910 && freq <= 4980) {
		return (freq - 4000) / 5;
	} else if (freq >= 5000 && freq < 5950) {
		return (freq - 5000) / 5;
	} else if (freq >= 5950 && freq <= 7215) {
		return (freq - 5950) / 5;
	} else if (freq >= 58320 && freq <= 64800) {
		return (freq - 56160) / 2160;
	} else {
		return 0;
	}
}

BAND_TYPE rtw_freq2band(int freq)
{
	if (freq <= 2484) {
		return BAND_ON_2_4G;
	} else if (freq >= 5000 && freq < 5950) {
		return BAND_ON_5G;
	}
#if CONFIG_IEEE80211_BAND_6GHZ
	else if (freq >= 5950 && freq <= 7215) {
		return BAND_ON_6G;
	}
#endif
	else {
		return BAND_MAX;
	}
}

bool rtw_freq_consecutive(int a, int b)
{
	BAND_TYPE band_a, band_b;

	band_a = rtw_freq2band(a);
	if (band_a == BAND_MAX) {
		return 0;
	}
	band_b = rtw_freq2band(b);
	if (band_b == BAND_MAX || band_a != band_b) {
		return 0;
	}

	switch (band_a) {
	case BAND_ON_2_4G:
		return rtw_abs(a - b) == 5;
	case BAND_ON_5G:
#if CONFIG_IEEE80211_BAND_6GHZ
	case BAND_ON_6G:
#endif
		return rtw_abs(a - b) == 20;
	default:
		return 0;
	}
}

bool rtw_chbw_to_freq_range(u8 ch, u8 bw, u8 offset, u32 *hi, u32 *lo)
{
	u8 c_ch;
	u32 freq;
	u32 hi_ret = 0, lo_ret = 0;
	bool valid = _FALSE;

	if (hi) {
		*hi = 0;
	}
	if (lo) {
		*lo = 0;
	}

