StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730a/core/rtw_rf.c
		if (opc_pref->ch_num) {
			rfctl->spt_op_class_ch[i] = opc_pref;
			op_class_num++;
		} else {
			opc_pref_free(opc_pref);
		}
	}

	rfctl->cap_spt_op_class_num = op_class_num;
	ret = _SUCCESS;

exit:
	return ret;
}

void op_class_pref_deinit(_adapter *adapter)
{
	struct rf_ctl_t *rfctl = adapter_to_rfctl(adapter);
	int i;

	if (!rfctl->spt_op_class_ch) {
		return;
	}

	for (i = 0; i < global_op_class_num; i++) {
		if (rfctl->spt_op_class_ch[i]) {
			opc_pref_free(rfctl->spt_op_class_ch[i]);
			rfctl->spt_op_class_ch[i] = NULL;
		}
	}

	rtw_mfree(rfctl->spt_op_class_ch, sizeof(struct op_class_pref_t *) * global_op_class_num);
	rfctl->spt_op_class_ch = NULL;
}

void op_class_pref_apply_regulatory(_adapter *adapter, u8 reason)
{
	struct rf_ctl_t *rfctl = adapter_to_rfctl(adapter);
	RT_CHANNEL_INFO *chset = rfctl->channel_set;
	struct registry_priv *regsty = adapter_to_regsty(adapter);
	u8 ch, bw, offset, cch;
	struct op_class_pref_t *opc_pref;
	int i, j;
	u8 reg_op_class_num = 0;
	u8 op_class_num = 0;

	for (i = 0; i < global_op_class_num; i++) {
		if (!rfctl->spt_op_class_ch[i]) {
			continue;
		}
		opc_pref = rfctl->spt_op_class_ch[i];

		/* reset all channel */
		for (j = 0; opc_pref->chs[j].ch != 0; j++) {
			if (reason >= REG_CHANGE) {
				opc_pref->chs[j].static_non_op = 1;
			}
			if (reason != REG_TXPWR_CHANGE) {
				opc_pref->chs[j].no_ir = 1;
			}
			if (reason >= REG_TXPWR_CHANGE) {
				opc_pref->chs[j].max_txpwr = UNSPECIFIED_MBM;
			}
		}
		if (reason >= REG_CHANGE) {
			opc_pref->op_ch_num = 0;
		}
		if (reason != REG_TXPWR_CHANGE) {
			opc_pref->ir_ch_num = 0;
		}

		switch (opc_pref->bw) {
		case OPC_BW20:
			bw = CHANNEL_WIDTH_20;
			offset = HAL_PRIME_CHNL_OFFSET_DONT_CARE;
			break;
		case OPC_BW40PLUS:
			bw = CHANNEL_WIDTH_40;
			offset = HAL_PRIME_CHNL_OFFSET_LOWER;
			break;
		case OPC_BW40MINUS:
			bw = CHANNEL_WIDTH_40;
			offset = HAL_PRIME_CHNL_OFFSET_UPPER;
			break;
		case OPC_BW80:
			bw = CHANNEL_WIDTH_80;
			offset = HAL_PRIME_CHNL_OFFSET_DONT_CARE;
			break;
		case OPC_BW160:
			bw = CHANNEL_WIDTH_160;
			offset = HAL_PRIME_CHNL_OFFSET_DONT_CARE;
			break;
		case OPC_BW80P80: /* TODO */
		default:
			continue;
		}

		if (!RFCTL_REG_EN_11AC(rfctl)
		    && (bw == CHANNEL_WIDTH_80 || bw == CHANNEL_WIDTH_160)) {
			continue;
		}

		for (j = 0; opc_pref->chs[j].ch != 0; j++) {
			u8 *op_chs;
			u8 op_ch_num;
			u8 k, l;
			int chset_idx;

			ch = opc_pref->chs[j].ch;

			if (reason >= REG_TXPWR_CHANGE) {
				opc_pref->chs[j].max_txpwr = rtw_rfctl_get_reg_max_txpwr_mbm(rfctl, ch, bw, offset, 1);
			}

			if (reason == REG_TXPWR_CHANGE) {
				continue;
			}

			cch = rtw_get_center_ch(ch, bw, offset);
			if (!cch) {
				continue;
			}

			if (!rtw_get_op_chs_by_cch_bw(cch, bw, &op_chs, &op_ch_num)) {
				continue;
			}

			for (k = 0, l = 0; k < op_ch_num; k++) {
				chset_idx = rtw_chset_search_ch(chset, *(op_chs + k));
				if (chset_idx == -1) {
					break;
				}
				if (bw >= CHANNEL_WIDTH_40) {
					if ((chset[chset_idx].flags & RTW_CHF_NO_HT40U) && k % 2 == 0) {
						break;
					}
					if ((chset[chset_idx].flags & RTW_CHF_NO_HT40L) && k % 2 == 1) {
						break;
					}
				}
				if (bw >= CHANNEL_WIDTH_80 && (chset[chset_idx].flags & RTW_CHF_NO_80MHZ)) {
					break;
				}
				if (bw >= CHANNEL_WIDTH_160 && (chset[chset_idx].flags & RTW_CHF_NO_160MHZ)) {
					break;
				}
				if ((chset[chset_idx].flags & RTW_CHF_DFS) && rtw_rfctl_dfs_domain_unknown(rfctl)) {
					continue;
				}
				if (chset[chset_idx].flags & RTW_CHF_NO_IR) {
					continue;
				}
				l++;
			}
			if (k < op_ch_num) {
				continue;
			}

			if (reason >= REG_CHANGE) {
				opc_pref->chs[j].static_non_op = 0;
				opc_pref->op_ch_num++;
			}

			if (l >= op_ch_num) {
				opc_pref->chs[j].no_ir = 0;
				opc_pref->ir_ch_num++;
			}
		}

		if (opc_pref->op_ch_num) {
			reg_op_class_num++;
		}
		if (opc_pref->ir_ch_num) {
			op_class_num++;
		}
	}

	rfctl->reg_spt_op_class_num = reg_op_class_num;
	rfctl->cur_spt_op_class_num = op_class_num;
}

static void dump_opc_pref_single(void *sel, struct op_class_pref_t *opc_pref, bool show_snon_ocp, bool show_no_ir, bool detail)
{
	u8 i;
	u8 ch_num = 0;
	char buf[256];
	char *pos = buf;

	if (!show_snon_ocp && !opc_pref->op_ch_num) {
		return;
	}
	if (!show_no_ir && !opc_pref->ir_ch_num) {
		return;
	}

	for (i = 0; opc_pref->chs[i].ch != 0; i++) {
		if ((show_snon_ocp || !opc_pref->chs[i].static_non_op)
		    && (show_no_ir || !opc_pref->chs[i].no_ir)
		   ) {
			if (detail) {
				pos += snprintf(pos, 256 - (pos - buf), " %4u", opc_pref->chs[i].ch);
			} else {
				pos += snprintf(pos, 256 - (pos - buf), " %u", opc_pref->chs[i].ch);
			}
		}
	}

	RTW_PRINT_SEL(sel, "%5u %4s %7s%s\n"
		      , opc_pref->class_id
		      , band_str(opc_pref->band)
		      , opc_bw_str(opc_pref->bw), buf);

	if (!detail) {
		return;
	}

	pos = buf;
	for (i = 0; opc_pref->chs[i].ch != 0; i++) {
		if ((show_snon_ocp || !opc_pref->chs[i].static_non_op)
		    && (show_no_ir || !opc_pref->chs[i].no_ir)
		   ) {
			pos += snprintf(pos, 256 - (pos - buf), "   %c%c"
					, opc_pref->chs[i].no_ir ? ' ' : 'I'
					, opc_pref->chs[i].static_non_op ? ' ' : 'E'
				       );
		}
	}
	RTW_PRINT_SEL(sel, "                  %s\n", buf);

	pos = buf;
	for (i = 0; opc_pref->chs[i].ch != 0; i++) {
		if ((show_snon_ocp || !opc_pref->chs[i].static_non_op)
		    && (show_no_ir || !opc_pref->chs[i].no_ir)
		   ) {
			if (opc_pref->chs[i].max_txpwr == UNSPECIFIED_MBM) {
				pos += snprintf(pos, 256 - (pos - buf), "     ");
			} else {
				pos += snprintf(pos, 256 - (pos - buf), " %4d", opc_pref->chs[i].max_txpwr);
			}
		}
	}
	RTW_PRINT_SEL(sel, "                  %s\n", buf);
}

void dump_cap_spt_op_class_ch(void *sel, struct rf_ctl_t *rfctl, bool detail)
{
	u8 i;

	dump_op_class_ch_title(sel);

	for (i = 0; i < global_op_class_num; i++) {
		if (!rfctl->spt_op_class_ch[i]) {
			continue;
		}
		dump_opc_pref_single(sel, rfctl->spt_op_class_ch[i], 1, 1, detail);
	}

	RTW_PRINT_SEL(sel, "op_class number:%d\n", rfctl->cap_spt_op_class_num);
}

void dump_reg_spt_op_class_ch(void *sel, struct rf_ctl_t *rfctl, bool detail)
{
	u8 i;

